# Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


a = input ("Введите трехначное число ")
print(int(a[0]) + int(a[1]) + int(a[2]))
